---
kind: property
id: P:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LuminaireDirtDepreciation
source: html/615be4c2-6112-9f73-ffca-dc164712d23f.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LuminaireDirtDepreciation Property

The luminaire dirt depreciation loss factor.

## Syntax (C#)
```csharp
public double LuminaireDirtDepreciation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.